namespace AccountingInformationSystem.Data.Entities
{
    /// <summary>
    /// Пільги
    /// </summary>
    public enum Benefits : byte
    {
        /// <summary>
        /// Немає пільги (0%)
        /// </summary>
        None = 0, // 0%
        /// <summary>
        /// Пільга по дітям (100% ПСП * кількість дітей)
        /// </summary>
        Kids = 1,
        /// <summary>
        /// Пільга по дітям, якщо тільки один опікун (150% ПСП * кількість дітей)
        /// </summary>
        Widow = 2,
        /// <summary>
        /// Пільга по дітям, якщо дитина з інвалідністю (150% ПСП * кількість дітей)
        /// </summary>
        KidsWithDisability = 3,
        /// <summary>
        /// Пільга особі, яка постраждала внаслідок аварії на ЧАЕС (1 та 2 категорії) 150%
        /// </summary>
        Chernobyl = 4,
        /// <summary>
        /// Пільга особі, яка є учнем, студентом, аспірантом, ординатором, ад'юнктом 150%
        /// </summary>
        Student = 5,
        /// <summary>
        /// Пільга особі з інвалідністю I групи, у тому числі з дитинства 150%
        /// </summary>
        FirstDisability = 6,
        /// <summary>
        /// Пільга особі з інвалідністю II групи, у тому числі з дитинства 150%
        /// </summary>
        SecondDisability = 7,
        /// <summary>
        /// Пільга особі, якій призначена довічна стипендія у звязку з переслідуваннями 
        /// за правозахисну діяльність, включаючи журналістів 150%
        /// </summary>
        AssignedLifetimeScholarship = 8,
        /// <summary>
        /// Пільга учаснику бойових дій на території інших країн у період після Другої світової війни 150%
        /// </summary>
        MilitaryAfterWWII = 9,
        /// <summary>
        /// Пільга Героєм України, Радянського Союзу, Соціалістичної Праці або повним 
        /// кавалером ордена Слави чи ордена Трудової Слави 200%
        /// </summary>
        HeroTitul = 10, //200%
        /// <summary>
        /// Пільга особі, яка нагороджена чотирма і більше медалями "За відвагу" 200%
        /// </summary>
        FourMedalForCourage = 11,
        /// <summary>
        /// Пільга учасником бойових дій під час Другої світової війни 200%
        /// </summary>
        MilitaryInWWII = 12,
        /// <summary>
        /// Пільга колишнім в'язням концтаборів, гетто та місць примусового утримання під час Другої світової війни 200%
        /// </summary>
        PrisonersOfConcentrationCamps = 13,
        /// <summary>
        /// Пільга особі, яка визнана репресованою чи реабілітованою 200%
        /// </summary>
        PersonRecognizedAsRepressedOrRehabilitated = 14,
    }
}